import './RightsPage.scss';

export const RightsPage = () => {
  return (
    <div className="page container">
      <h1 className="title">Права та умови використання</h1>
      <section className="section">
        <ol className='section__list'>
          <li className='section__list--name'>Умови використання</li>
          <p className='section__list--text'>
            Використовуючи нашу платформу, ви погоджуєтесь дотримуватись цих
            правил. Користувачам забороняється створювати або поширювати квести,
            які містять образливий, незаконний чи неетичний контент.
            Адміністрація залишає за собою право видаляти такий контент без
            попередження.
          </p>
          <li className='section__list--name'>Авторські права та ліцензії</li>
          <p className='section__list--text'>
          Весь контент, створений користувачами, залишається їхньою власністю. Проте, публікуючи квест на платформі, ви надаєте нам право використовувати його для демонстрації, реклами та покращення сервісу. Якщо ви використовуєте матеріали третіх осіб, переконайтесь, що маєте на це відповідний дозвіл.
          </p>
          <li className='section__list--name'>Політика конфіденційності</li>
          <p className='section__list--text'>
          Ми збираємо мінімум необхідної інформації для роботи сервісу, включаючи ваш email, ім’я користувача та дані про проходження квестів. Ця інформація використовується виключно для покращення роботи платформи та не передається третім особам без вашого дозволу.
          </p>
          <li className='section__list--name'>Відповідальність платформи</li>
          <p className='section__list--text'>
          Платформа не несе відповідальності за зміст квестів, створених користувачами. Якщо ви виявили контент, який порушує правила, повідомте про це через форму зворотного зв’язку.
          </p>
          <li className='section__list--name'>Покарання за порушення</li>
          <p className='section__list--text'>
          У разі порушення правил ваш акаунт може бути тимчасово або назавжди заблоковано. Скарги на квести розглядаються адміністрацією, і у разі серйозних порушень контент може бути видалено.
          </p>
        </ol>
      </section>
    </div>
  );
};
